import 'package:auto_route/auto_route.dart';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:flutter_svg/svg.dart';
import 'package:nurlan_ustaz_flutter/core/model/tus_zhoru_model.dart';

import '../../core/common/app_styles.dart';
import '../../core/common/assets.dart';
import '../../core/common/colors.dart';
import '../../core/router/app_router.dart';
import '../app/presentation/widgets/custom_app_bar.dart';
import '../app/presentation/widgets/custom_tab_bar.dart';
import '../app/presentation/widgets/global_appbar_widget.dart';
import '../app/presentation/widgets/search_widget.dart';

class TusZhoruPage extends StatelessWidget {
  TusZhoruPage({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: AppColors.white,
      body: SingleChildScrollView(
        physics: const BouncingScrollPhysics(),
        child: SizedBox(
          height: 1.1.sh,
          child: Stack(
            children: [
              const GlobalAppBar(),
              Positioned(
                top: 80.h,
                left: 16.r,
                right: 16.r,
                child: Column(
                  children: [
                    const CustomAppBar(
                      hideIcon: true,
                      title: 'Түс жору',
                    ),
                    SizedBox(
                      height: 36.h,
                    ),
                    SearchWidget(
                      onChanged: (value) {},
                    ),
                    SizedBox(
                      height: 20,
                    ),
                    CustomTabBar(
                      tabs: [
                        Tab(
                          text: 'Барлығы',
                        ),
                        Tab(
                          text: 'Өз түсім',
                        ),
                      ],
                      onTap: (int) {},
                      length: 2,
                    ),

                    ListView.separated(
                      itemCount: _mockList.length,
                      shrinkWrap: true,
                      physics: const BouncingScrollPhysics(),
                      itemBuilder: (context, index) {
                        return Padding(
                          padding: EdgeInsets.symmetric(horizontal: 1.sp),
                          child: GestureDetector(
                            onTap: () {
                              context.router.push(
                                const SeminarDetailPageRoute(),
                              );
                            },
                            child: Container(
                              height: 71,
                              decoration: BoxDecoration(
                                color: AppColors.white,
                                borderRadius: BorderRadius.circular(20),
                              ),
                              padding: EdgeInsets.symmetric(
                                  vertical: 15, horizontal: 16),
                              child: Row(
                                crossAxisAlignment: CrossAxisAlignment.start,
                                mainAxisAlignment:
                                    MainAxisAlignment.spaceBetween,
                                children: [
                                  Column(
                                    mainAxisAlignment:
                                        MainAxisAlignment.spaceBetween,
                                    crossAxisAlignment:
                                        CrossAxisAlignment.start,
                                    children: [
                                      Text(
                                        _mockList[index].title,
                                        style: getTextStyle(
                                                CustomTextStyles.s16w500)
                                            .apply(
                                                fontFamily:
                                                    FontTypes.SF_Pro.name),
                                      ),
                                      SizedBox(
                                        height: 4,
                                      ),
                                      Text(
                                        _mockList[index].subtitle.length > 30
                                            ? _mockList[index]
                                                    .subtitle
                                                    .substring(0, 30) +
                                                '...'
                                            : _mockList[index].subtitle,
                                        maxLines: 1,
                                        overflow: TextOverflow.ellipsis,
                                        style: getTextStyle(
                                                CustomTextStyles.s14w400)
                                            .apply(
                                                fontFamily:
                                                    FontTypes.SF_Pro.name,
                                                color: AppColors.grey1
                                                    .withOpacity(0.55)),
                                      )
                                    ],
                                  ),
                                  SizedBox(
                                    width: 12.w,
                                  ),
                                  Center(
                                    child: SvgPicture.asset(
                                      'assets/icons/chevronDown.svg',
                                      color: AppColors.primaryColor,
                                    ),
                                  )
                                ],
                              ),
                            ),
                          ),
                        );
                      },
                      separatorBuilder: (BuildContext context, int index) {
                        return SizedBox(
                          height: 8,
                        );
                      },
                    ),
                  ],
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }

  final List<TusZhoruModel> _mockList = <TusZhoruModel>[
    TusZhoruModel(
        title: 'Адасу, қателік',
        subtitle:
            'Адам түсінде қателессе не жолдан адасса, онда бұл оның тура жолдан ауытқуын білдіреді.',
        textInfo:
            'Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз',
        isPayed: false),
    TusZhoruModel(
        title: 'Адасу, қателік',
        subtitle:
            'Адам түсінде қателессе не жолдан адасса, онда бұл оның тура жолдан ауытқуын білдіреді.',
        textInfo:
            'Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз',
        isPayed: false),
    TusZhoruModel(
        title: 'Адасу, қателік',
        subtitle:
            'Адам түсінде қателессе не жолдан адасса, онда бұл оның тура жолдан ауытқуын білдіреді.',
        textInfo:
            'Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз',
        isPayed: false),
    TusZhoruModel(
        title: 'Адасу, қателік',
        subtitle:
            'Адам түсінде қателессе не жолдан адасса, онда бұл оның тура жолдан ауытқуын білдіреді.',
        textInfo:
            'Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз',
        isPayed: false),
    TusZhoruModel(
        title: 'Адасу, қателік',
        subtitle:
            'Адам түсінде қателессе не жолдан адасса, онда бұл оның тура жолдан ауытқуын білдіреді.',
        textInfo:
            'Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз',
        isPayed: false),
    TusZhoruModel(
        title: 'Адасу, қателік',
        subtitle:
            'Адам түсінде қателессе не жолдан адасса, онда бұл оның тура жолдан ауытқуын білдіреді.',
        textInfo:
            'Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз',
        isPayed: false),
    TusZhoruModel(
        title: 'Адасу, қателік',
        subtitle:
            'Адам түсінде қателессе не жолдан адасса, онда бұл оның тура жолдан ауытқуын білдіреді.',
        textInfo:
            'Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз',
        isPayed: false),
    TusZhoruModel(
        title: 'Адасу, қателік',
        subtitle:
            'Адам түсінде қателессе не жолдан адасса, онда бұл оның тура жолдан ауытқуын білдіреді.',
        textInfo:
            'Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз',
        isPayed: false),
    TusZhoruModel(
        title: 'Адасу, қателік',
        subtitle:
            'Адам түсінде қателессе не жолдан адасса, онда бұл оның тура жолдан ауытқуын білдіреді.',
        textInfo:
            'Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз',
        isPayed: false),
    TusZhoruModel(
        title: 'Адасу, қателік',
        subtitle:
            'Адам түсінде қателессе не жолдан адасса, онда бұл оның тура жолдан ауытқуын білдіреді.',
        textInfo:
            'Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз.Жас бала – қуаныш, танымайтын – дұшпан, ересек адамды жас бала кейпінде – сенімсіздік, өзіңіз танымайтын жас жігіт – біреудің өкініші, келіншек – байлық, қызықшылық, ақсақал – тоқтық, жас жігіт қартайса – көңіл көтеріледі;Түсте көпшілік қауымды көрсеңіз, көре алмайтын әрі екіжүзді адамдардың соңынан ересіз',
        isPayed: false),
  ];
  int selectedIndex = -1;
}
